const verses = [
  "الرب راعيَّ فلا يعوزني شيء (مزمور 23: 1)",
  "أنا هو نور العالم. من يتبعني فلا يمشي في الظلمة (يوحنا 8: 12)",
  "كل الأشياء تعمل معًا للخير للذين يحبون الله (رومية 8: 28)",
  "تعالوا إليَّ يا جميع المتعبين والثقيلي الأحمال وأنا أريحكم (متى 11: 28)",
  "سلامي أترك لكم. سلامي أعطيكم (يوحنا 14: 27)",
  "طوبى لأنقياء القلب لأنهم يعاينون الله (متى 5: 8)",
  "الرب نوري وخلاصي ممن أخاف؟ (مزمور 27: 1)",
  "أستطيع كل شيء في المسيح الذي يقويني (فيلبي 4:13)",
  "الرَّبَّ رَؤُوفٌ رَحِيمٌ، يَغْفِرُ الْخَطَايَا وَيُخَلِّصُ فِي يَوْمِ الضِّيقِ (سفر يشوع بن سيراخ 13:2)",
  "فَرِحِينَ فِي الرَّجَاءِ، صَابِرِينَ فِي الضَّيْقِ، مُواظِبِينَ عَلَى الصَّلاَةِ (رسالة بولس الرسول إلى أهل رومية 12:12)",
  "فِي الْعَالَمِ سَيَكُونُ لَكُمْ ضِيقٌ، وَلكِنْ ثِقُوا: أَنَا قَدْ غَلَبْتُ الْعَالَمَ (إنجيل يوحنا 33:16)",
  "لاَ تَحْزَنُوا، لأَنَّ فَرَحَ الرَّبِّ هُوَ قُوَّتُكُمْ. (سفر نحميا 10:8)",
  "اِفْرَحُوا فِي الرَّبِّ كُلَّ حِينٍ، وَأَقُولُ أَيْضًا: افْرَحُوا. (رسالة بولس الرسول إلى أهل فيلبي 4: 4)",
  "اتْرُكْهَا هذِهِ السَّنَةَ أَيْضًا (لوقا 13: 8)",
  "كَلَّلْتَ السَّنَةَ بِجُودِكَ وَآثارُكَ تَقْطُرُ دَسَمًا (مز 65 : 11)",
  "وَأُعْطِيكُمْ قَلْبًا جَدِيدًا وَأَجْعَلُ رُوحًا جَدِيدَةً فِي دَاخِلِكُمْ (حز 36: 26)",
  "عَيْنَا الرَّبِّ إِلهِكَ عَلَيْهَا دَائِمًا مِنْ أَوَّلِ السَّنَةِ إِلَى آخِرِهَا (تث 11: 12)",
  "أنه من احسانات الرب أننا لم نفنا لأن مراحمه لا تزول هي جديدة في كل صباح (مراثي ارميا 22:3)",
  "الرب قريب من المنكسري القلوب ويخلّص المنسحقين بالروح (مزمور 18:34)",
  "أَلْقِ عَلَى الرَّبِّ هَمَّكَ فَهُوَ يَعُولُكَ. لاَ يَدَعُ الصِّدِّيقَ يَتَزَعْزَعُ إِلَى الأَبَد. (مزمور 22:55)",
  "هُوَذَا اللهُ خَلاَصِي فَأَطْمَئِنُّ وَلاَ أَرْتَعِبُ، لأَنَّ يَاهَ يَهْوَهَ قُوَّتِي وَتَرْنِيمَتِي وَقَدْ صَارَ لِي خَلاَصًا (إشعياء 12:2)",
  "أُهْمِلُكَ وَلاَ أَتْرُكُكَ. (يشوع 5:1)",
  "وَسَلاَمُ اللهِ الَّذِي يَفُوقُ كُلَّ عَقْل، يَحْفَظُ قُلُوبَكُمْ وَأَفْكَارَكُمْ فِي الْمَسِيحِ يَسُوعَ. (فيلبي 7:4)",
  "صَالِحٌ هُوَ الرَّبُّ. حِصْنٌ فِي يَوْمِ الضَّيقِ، وَهُوَ يَعْرِفُ الْمُتَوَكِّلِينَ عَلَيْهِ. (ناحوم 7:1)",
  "طُوبَى لِلْحَزَانَى، لأَنَّهُمْ يَتَعَزَّوْنَ. (متى 4:5)",
  "لاَ تَخَفْ لأَنِّي مَعَكَ. لاَ تَتَلَفَّتْ لأَنِّي إِلهُكَ. قَدْ أَيَّدْتُكَ وَأَعَنْتُكَ وَعَضَدْتُكَ بِيَمِينِ بِرِّي. (إشعياء 10:41)",
  "لكِنِ اطْلُبُوا أَوَّلًا مَلَكُوتَ اللهِ وَبِرَّهُ، وَهذِهِ كُلُّهَا تُزَادُ لَكُمْ. (متى 33:6)",
  "كَرَاعٍ يَرْعَى قَطِيعَهُ. بِذِرَاعِهِ يَجْمَعُ الْحُمْلاَنَ، وَفِي حِضْنِهِ يَحْمِلُهَا، وَيَقُودُ الْمُرْضِعَاتِ (إشعياء 11:40)",

  
  
];

// اختيار آية عشوائية
const randomVerse = verses[Math.floor(Math.random() * verses.length)];
document.getElementById("verse").innerText = randomVerse;


// منع الكليك يمين على الصور فقط
document.addEventListener("contextmenu", function(e){
  if (e.target.tagName === "IMG") {
    e.preventDefault();
  }
});
