const verses = [
  "الرب راعيَّ فلا يعوزني شيء (مزمور 23: 1)",
  "أنا هو نور العالم. من يتبعني فلا يمشي في الظلمة (يوحنا 8: 12)",
  "كل الأشياء تعمل معًا للخير للذين يحبون الله (رومية 8: 28)",
  "تعالوا إليَّ يا جميع المتعبين والثقيلي الأحمال وأنا أريحكم (متى 11: 28)",
  "سلامي أترك لكم. سلامي أعطيكم (يوحنا 14: 27)",
  "طوبى لأنقياء القلب لأنهم يعاينون الله (متى 5: 8)",
  "الرب نوري وخلاصي ممن أخاف؟ (مزمور 27: 1)",
  "أستطيع كل شيء في المسيح الذي يقويني (فيلبي 4:13)",
  "الرَّبَّ رَؤُوفٌ رَحِيمٌ، يَغْفِرُ الْخَطَايَا وَيُخَلِّصُ فِي يَوْمِ الضِّيقِ (سفر يشوع بن سيراخ 13:2)",
  "فَرِحِينَ فِي الرَّجَاءِ، صَابِرِينَ فِي الضَّيْقِ، مُواظِبِينَ عَلَى الصَّلاَةِ (رسالة بولس الرسول إلى أهل رومية 12:12)",
  "فِي الْعَالَمِ سَيَكُونُ لَكُمْ ضِيقٌ، وَلكِنْ ثِقُوا: أَنَا قَدْ غَلَبْتُ الْعَالَمَ (إنجيل يوحنا 33:16)",
  "لاَ تَحْزَنُوا، لأَنَّ فَرَحَ الرَّبِّ هُوَ قُوَّتُكُمْ. (سفر نحميا 10:8)",
  "اِفْرَحُوا فِي الرَّبِّ كُلَّ حِينٍ، وَأَقُولُ أَيْضًا: افْرَحُوا. (رسالة بولس الرسول إلى أهل فيلبي 4: 4)",
  "اتْرُكْهَا هذِهِ السَّنَةَ أَيْضًا (لوقا 13: 8)",
  "كَلَّلْتَ السَّنَةَ بِجُودِكَ وَآثارُكَ تَقْطُرُ دَسَمًا (مز 65 : 11)",
  "وَأُعْطِيكُمْ قَلْبًا جَدِيدًا وَأَجْعَلُ رُوحًا جَدِيدَةً فِي دَاخِلِكُمْ (حز 36: 26)",
  "عَيْنَا الرَّبِّ إِلهِكَ عَلَيْهَا دَائِمًا مِنْ أَوَّلِ السَّنَةِ إِلَى آخِرِهَا (تث 11: 12)",
  "أنه من احسانات الرب أننا لم نفنا لأن مراحمه لا تزول هي جديدة في كل صباح (مراثي ارميا 22:3)",
  "الرب قريب من المنكسري القلوب ويخلّص المنسحقين بالروح (مزمور 18:34)",
  "أَلْقِ عَلَى الرَّبِّ هَمَّكَ فَهُوَ يَعُولُكَ. لاَ يَدَعُ الصِّدِّيقَ يَتَزَعْزَعُ إِلَى الأَبَد. (مزمور 22:55)",
  "هُوَذَا اللهُ خَلاَصِي فَأَطْمَئِنُّ وَلاَ أَرْتَعِبُ، لأَنَّ يَاهَ يَهْوَهَ قُوَّتِي وَتَرْنِيمَتِي وَقَدْ صَارَ لِي خَلاَصًا (إشعياء 12:2)",
  "لاَ أُهْمِلُكَ وَلاَ أَتْرُكُكَ. (يشوع 5:1)",
  "وَسَلاَمُ اللهِ الَّذِي يَفُوقُ كُلَّ عَقْل، يَحْفَظُ قُلُوبَكُمْ وَأَفْكَارَكُمْ فِي الْمَسِيحِ يَسُوعَ. (فيلبي 7:4)",
  "صَالِحٌ هُوَ الرَّبُّ. حِصْنٌ فِي يَوْمِ الضَّيقِ، وَهُوَ يَعْرِفُ الْمُتَوَكِّلِينَ عَلَيْهِ. (ناحوم 7:1)",
  "طُوبَى لِلْحَزَانَى، لأَنَّهُمْ يَتَعَزَّوْنَ. (متى 4:5)",
  "لاَ تَخَفْ لأَنِّي مَعَكَ. لاَ تَتَلَفَّتْ لأَنِّي إِلهُكَ. قَدْ أَيَّدْتُكَ وَأَعَنْتُكَ وَعَضَدْتُكَ بِيَمِينِ بِرِّي. (إشعياء 10:41)",
  "لكِنِ اطْلُبُوا أَوَّلًا مَلَكُوتَ اللهِ وَبِرَّهُ، وَهذِهِ كُلُّهَا تُزَادُ لَكُمْ. (متى 33:6)",
  "كَرَاعٍ يَرْعَى قَطِيعَهُ. بِذِرَاعِهِ يَجْمَعُ الْحُمْلاَنَ، وَفِي حِضْنِهِ يَحْمِلُهَا، وَيَقُودُ الْمُرْضِعَاتِ (إشعياء 11:40)",
  "فَقَالَ لَهُمْ يَسُوعُ: «أَنَا هُوَ خُبْزُ الْحَيَاةِ. مَنْ يُقْبِلْ إِلَيَّ فَلاَ يَجُوعُ، وَمَنْ يُؤْمِنْ بِي فَلاَ يَعْطَشُ أَبَدًا.(يوحنا 35:6)",
  "لاَ تَهْتَمُّوا بِشَيْءٍ، بَلْ فِي كُلِّ شَيْءٍ بِالصَّلاَةِ وَالدُّعَاءِ مَعَ الشُّكْرِ، لِتُعْلَمْ طِلْبَاتُكُمْ لَدَى اللهِ. (فيلبي 6:4)",
  "أَيْضًا إِذَا سِرْتُ فِي وَادِي ظِلِّ الْمَوْتِ لاَ أَخَافُ شَرًّا، لأَنَّكَ أَنْتَ مَعِي. عَصَاكَ وَعُكَّازُكَ هُمَا يُعَزِّيَانِنِي. (مزمور 4:23)",
  "طَيِّبٌ هُوَ الرَّبُّ لِلَّذِينَ يَتَرَجَّوْنَهُ، لِلنَّفْسِ الَّتِي تَطْلُبُهُ. (مراثي 25:3)",
  "لِذلِكَ اطْرَحُوا عَنْكُمُ الْكَذِبَ، وَتَكَلَّمُوا بِالصِّدْقِ كُلُّ وَاحِدٍ مَعَ قَرِيبِهِ، لأَنَّنَا بَعْضَنَا أَعْضَاءُ الْبَعْضِ. (أفسس 25:4)",
  "وَأَمَّا مُنْتَظِرُو الرَّبِّ فَيُجَدِّدُونَ قُوَّةً. يَرْفَعُونَ أَجْنِحَةً كَالنُّسُورِ. يَرْكُضُونَ وَلاَ يَتْعَبُونَ. يَمْشُونَ وَلاَ يُعْيُونَ. (إشعياء 31:40)",
  "أَنْتُمْ نُورُ الْعَالَمِ. لاَ يُمْكِنُ أَنْ تُخْفَى مَدِينَةٌ مَوْضُوعَةٌ عَلَى جَبَل (متى 14:5)",
  "وَعَلِّمُوهُمْ أَنْ يَحْفَظُوا جَمِيعَ مَا أَوْصَيْتُكُمْ بِهِ. وَهَا أَنَا مَعَكُمْ كُلَّ الأَيَّامِ إِلَى انْقِضَاءِ الدَّهْرِ». آمِينَ. (متى 20:28)",
  "ذُوقُوا وَانْظُرُوا مَا أَطْيَبَ الرَّبَّ! طُوبَى لِلرَّجُلِ الْمُتَوَكِّلِ عَلَيْهِ. (مزمور 8:34)",
  "طُوبَى لِلرُّحَمَاءِ، لأَنَّهُمْ يُرْحَمُونَ. (متى 7:5)",
  "فَقَالَ لِي: «تَكْفِيكَ نِعْمَتِي، لأَنَّ قُوَّتِي فِي الضَّعْفِ تُكْمَلُ». فَبِكُلِّ سُرُورٍ أَفْتَخِرُ بِالْحَرِيِّ فِي ضَعَفَاتِي، لِكَيْ تَحِلَّ عَلَيَّ قُوَّةُ الْمَسِيحِ. (2 كورنثوس 9:12)",
  "لِيَتْرُكِ الشِّرِّيرُ طَرِيقَهُ، وَرَجُلُ الإِثْمِ أَفْكَارَهُ، وَلْيَتُبْ إِلَى الرَّبِّ فَيَرْحَمَهُ، وَإِلَى إِلهِنَا لأَنَّهُ يُكْثِرُ الْغُفْرَانَ. (إشعياء 7:55)",
  "يَا رَبُّ، أَنْتَ إِلهِي أُعَظِّمُكَ. أَحْمَدُ اسْمَكَ لأَنَّكَ صَنَعْتَ عَجَبًا. مَقَاصِدُكَ مُنْذُ الْقَدِيمِ أَمَانَةٌ وَصِدْقٌ. (إشعياء 1:25)",
  "اُطْلُبُوا الرَّبَّ مَا دَامَ يُوجَدُ. ادْعُوهُ وَهُوَ قَرِيبٌ. (إشعياء 6:55)",
  "لكِنَّكُمْ سَتَنَالُونَ قُوَّةً مَتَى حَلَّ الرُّوحُ الْقُدُسُ عَلَيْكُمْ، وَتَكُونُونَ لِي شُهُودًا فِي أُورُشَلِيمَ وَفِي كُلِّ الْيَهُودِيَّةِ وَالسَّامِرَةِ وَإِلَى أَقْصَى الأَرْضِ (أعمال 8:1)",
  "فَصَلُّوا أَنْتُمْ هكَذَا: أَبَانَا الَّذِي فِي السَّمَاوَاتِ، لِيَتَقَدَّسِ اسْمُكَ. (متى 9:6)",
  "يَشْفِي الْمُنْكَسِرِي الْقُلُوبِ، وَيَجْبُرُ كَسْرَهُمْ. (مزمور 3:147)",
  "فَلاَ تَخَافُوا! أَنْتُمْ أَفْضَلُ مِنْ عَصَافِيرَ كَثِيرَةٍ! (متى 31:10)",
  "فَاثْبُتُوا إِذًا فِي الْحُرِّيَّةِ الَّتِي قَدْ حَرَّرَنَا الْمَسِيحُ بِهَا، وَلاَ تَرْتَبِكُوا أَيْضًا بِنِيرِ عُبُودِيَّةٍ. (غلاطية 1:5)",
  "وَجَعَلَ فِي فَمِي تَرْنِيمَةً جَدِيدَةً، تَسْبِيحَةً لإِلهِنَا. كَثِيرُونَ يَرَوْنَ وَيَخَافُونَ وَيَتَوَكَّلُونَ عَلَى الرَّبِّ. (مزمور 3:40)",
  "وَأَمَّا أَنَا فَأَقُولُ لَكُمْ: أَحِبُّوا أَعْدَاءَكُمْ. بَارِكُوا لاَعِنِيكُمْ. أَحْسِنُوا إِلَى مُبْغِضِيكُمْ، وَصَلُّوا لأَجْلِ الَّذِينَ يُسِيئُونَ إِلَيْكُمْ وَيَطْرُدُونَكُمْ (متى 44:5)",
  "أَمِيلُوا آذَانَكُمْ وَهَلُمُّوا إِلَيَّ. اسْمَعُوا فَتَحْيَا أَنْفُسُكُمْ. وَأَقْطَعَ لَكُمْ عَهْدًا أَبَدِيًّا، مَرَاحِمَ دَاوُدَ الصَّادِقَةَ. (إشعياء 3:55)",
  "هنَذَا وَاقِفٌ عَلَى الْبَابِ وَأَقْرَعُ. إِنْ سَمِعَ أَحَدٌ صَوْتِي وَفَتَحَ الْبَابَ، أَدْخُلُ إِلَيْهِ وَأَتَعَشَّى مَعَهُ وَهُوَ مَعِي. (رؤيا 20:3)",
  "يَا رَبَّ الْجُنُودِ، طُوبَى لِلإِنْسَانِ الْمُتَّكِلِ عَلَيْكَ. (مزمور 12:84)",
  "أُبَارِكُ الرَّبَّ فِي كُلِّ حِينٍ. دَائِمًا تَسْبِيحُهُ فِي فَمِي. (مزمور 1:34)",
  "سِرَاجٌ لِرِجْلِي كَلاَمُكَ وَنُورٌ لِسَبِيلِي. (مزمور 105:119)",
  "اُثْبُتُوا فِيَّ وَأَنَا فِيكُمْ. كَمَا أَنَّ الْغُصْنَ لاَ يَقْدِرُ أَنْ يَأْتِيَ بِثَمَرٍ مِنْ ذَاتِهِ إِنْ لَمْ يَثْبُتْ فِي الْكَرْمَةِ، كَذلِكَ أَنْتُمْ أَيْضًا إِنْ لَمْ تَثْبُتُوا فِيَّ. (يوحنا 4:15)",
  "فَأَنْتُمْ كَذلِكَ، عِنْدَكُمُ الآنَ حُزْنٌ. وَلكِنِّي سَأَرَاكُمْ أَيْضًا فَتَفْرَحُ قُلُوبُكُمْ، وَلاَ يَنْزِعُ أَحَدٌ فَرَحَكُمْ مِنْكُمْ. (يوحنا 22:16)",
  "وَفِي الْيَوْمِ الأَخِيرِ الْعَظِيمِ مِنَ الْعِيدِ وَقَفَ يَسُوعُ وَنَادَى قِائِلًا: «إِنْ عَطِشَ أَحَدٌ فَلْيُقْبِلْ إِلَيَّ وَيَشْرَبْ. (يوحنا 37:7)",
  "وَأَقَامَنَا مَعَهُ، وَأَجْلَسَنَا مَعَهُ فِي السَّمَاوِيَّاتِ فِي الْمَسِيحِ يَسُوعَ (أفسس 6:2)",
  "الرَّبُّ يَحْفَظُكَ مِنْ كُلِّ شَرّ. يَحْفَظُ نَفْسَكَ. (مزمور 7:121)",
  "عَلَى اللهِ تَوَكَّلْتُ فَلاَ أَخَافُ. مَاذَا يَصْنَعُهُ بِي الإِنْسَانُ؟ (مزمور 11:56)",
  "أَنْتُمْ مِنَ اللهِ أَيُّهَا الأَوْلاَدُ، وَقَدْ غَلَبْتُمُوهُمْ لأَنَّ الَّذِي فِيكُمْ أَعْظَمُ مِنَ الَّذِي فِي الْعَالَمِ. (1 يوحنا 4:4)",
  "فَقَالَ: «هَا أَنَا أَنْظُرُ السَّمَاوَاتِ مَفْتُوحَةً، وَابْنَ الإِنْسَانِ قَائِمًا عَنْ يَمِينِ اللهِ». (أعمال 56:7)",
  "يُعْطِي الْمُعْيِيَ قُدْرَةً، وَلِعَدِيمِ الْقُوَّةِ يُكَثِّرُ شِدَّةً. (إشعياء 29:40)",
  "اِسْمَعْ هذَا أَيُّهَا الشَّعْبُ الْجَاهِلُ وَالْعَدِيمُ الْفَهْمِ، الَّذِينَ لَهُمْ أَعْيُنٌ وَلاَ يُبْصِرُونَ. لَهُمْ آذَانٌ وَلاَ يَسْمَعُونَ. (إرميا 21:5)",
  "بَرَكَةُ الرَّبِّ هِيَ تُغْنِي، وَلاَ يَزِيدُ مَعَهَا تَعَبًا. (أمثال 22:10)",
  "لاَ أَتْرُكُكُمْ يَتَامَى. إِنِّي آتِي إِلَيْكُمْ. (يوحنا 18:14)",
  "لأَنَّهُ يُنَجِّيكَ مِنْ فَخِّ الصَّيَّادِ وَمِنَ الْوَبَإِ الْخَطِرِ. (مزمور 3:91)",
  "وَهُوَ يُغَيِّرُ الأَوْقَاتَ وَالأَزْمِنَةَ. يَعْزِلُ مُلُوكًا وَيُنَصِّبُ مُلُوكًا. يُعْطِي الْحُكَمَاءَ حِكْمَةً، وَيُعَلِّمُ الْعَارِفِينَ فَهْمًا. (دانيال 21:2)",
  "وَأَجْعَلُ سَلاَمًا فِي الأَرْضِ، فَتَنَامُونَ وَلَيْسَ مَنْ يُزْعِجُكُمْ. وَأُبِيدُ الْوُحُوشَ الرَّدِيئَةَ مِنَ الأَرْضِ، وَلاَ يَعْبُرُ سَيْفٌ فِي أَرْضِكُمْ. (لاويين 6:26)",


  
  
];

// اختيار آية عشوائية
const randomVerse = verses[Math.floor(Math.random() * verses.length)];
document.getElementById("verse").innerText = randomVerse;


// منع الكليك يمين على الصور فقط
document.addEventListener("contextmenu", function(e){
  if (e.target.tagName === "IMG") {
    e.preventDefault();
  }
});
