const verses = [
  "الرب راعيَّ فلا يعوزني شيء (مزمور 23: 1)",
  "أنا هو نور العالم. من يتبعني فلا يمشي في الظلمة (يوحنا 8: 12)",
  "كل الأشياء تعمل معًا للخير للذين يحبون الله (رومية 8: 28)",
  "تعالوا إليَّ يا جميع المتعبين والثقيلي الأحمال وأنا أريحكم (متى 11: 28)",
  "سلامي أترك لكم. سلامي أعطيكم (يوحنا 14: 27)",
  "طوبى لأنقياء القلب لأنهم يعاينون الله (متى 5: 8)",
  "الرب نوري وخلاصي ممن أخاف؟ (مزمور 27: 1)",
  "أستطيع كل شيء في المسيح الذي يقويني (فيلبي 4:13)",
  "الرَّبَّ رَؤُوفٌ رَحِيمٌ، يَغْفِرُ الْخَطَايَا وَيُخَلِّصُ فِي يَوْمِ الضِّيقِ (سفر يشوع بن سيراخ 13:2)",
  "فَرِحِينَ فِي الرَّجَاءِ، صَابِرِينَ فِي الضَّيْقِ، مُواظِبِينَ عَلَى الصَّلاَةِ (رسالة بولس الرسول إلى أهل رومية 12:12)",
  "فِي الْعَالَمِ سَيَكُونُ لَكُمْ ضِيقٌ، وَلكِنْ ثِقُوا: أَنَا قَدْ غَلَبْتُ الْعَالَمَ (إنجيل يوحنا 33:16)",
  "لاَ تَحْزَنُوا، لأَنَّ فَرَحَ الرَّبِّ هُوَ قُوَّتُكُمْ. (سفر نحميا 10:8)",
  "اِفْرَحُوا فِي الرَّبِّ كُلَّ حِينٍ، وَأَقُولُ أَيْضًا: افْرَحُوا. (رسالة بولس الرسول إلى أهل فيلبي 4: 4)",
  "اتْرُكْهَا هذِهِ السَّنَةَ أَيْضًا (لوقا 13: 8)",
  "كَلَّلْتَ السَّنَةَ بِجُودِكَ وَآثارُكَ تَقْطُرُ دَسَمًا (مز 65 : 11)",
  "وَأُعْطِيكُمْ قَلْبًا جَدِيدًا وَأَجْعَلُ رُوحًا جَدِيدَةً فِي دَاخِلِكُمْ (حز 36: 26)",
  "عَيْنَا الرَّبِّ إِلهِكَ عَلَيْهَا دَائِمًا مِنْ أَوَّلِ السَّنَةِ إِلَى آخِرِهَا (تث 11: 12)",
  "أنه من احسانات الرب أننا لم نفنا لأن مراحمه لا تزول هي جديدة في كل صباح (مراثي ارميا 22:3)"
  
];

// اختيار آية عشوائية
const randomVerse = verses[Math.floor(Math.random() * verses.length)];
document.getElementById("verse").innerText = randomVerse;


// منع الكليك يمين على الصور فقط
document.addEventListener("contextmenu", function(e){
  if (e.target.tagName === "IMG") {
    e.preventDefault();
  }
});
